{
  "de": [
    "Da mir die Anziehungskraft fehlt, bin ich immernoch nackt...",
    "\"Warum haben Sie das Unternehmen verlassen?\"\n-\n\"Der fähigste leitende Mitarbeiter war ein Kupferkabel.\"",
    "Wieso freuen sich online Gärtnereien nicht über viel Kundschaft?\n-\nWeil dann so viele Bestellungen eingehen!",
    "Warum können Bienen so gut rechnen?\n-\nWeil sie die ganze Zeit mit summen zu Gange sind.",
    "Was macht ein Pirat am Computer?\n-\nEr drückt die Entertaste!",
    "Multitasking - Jetzt kann man mehrere Anwendungen gleichzeitig abstürzen lassen.",
    "Was heißt \"www\"?\n-\nWeltweites Warten.",
    "Warum trinken Mäuse keinen Alkohol?\n-\nWeil sie Angst vorm Kater haben.",
    "Lehrerin: \"Wer kann einen Satz mit Weihnachtsfest bilden?\"\n-\nFritzchen: \"Der Elch hält sein Geweih nachts fest.\"",
    "Was sitzt auf dem Baum und ruft Aha?\n-\nEin Uhu mit Sprachfehler.",
    "Was sitzt auf einem Baum und winkt?\n-\nEin Huhu.",
    "Treffen sich ein Thunfisch und ein Walfisch. Sagt der Walfisch: \"Was sollen wir tun, Fisch?\"\nAntwortet der Thunfisch: \"Du hast die Wahl, Fisch.\"",
    "Was sagt ein großer Stift zum kleinen Stift?\n-\n\"Wachsmalstift!\"",
    "Sie: \"Schatz, im Büro haben sie heute gesagt, dass ich sooo schöne Beine habe!\"\nEr: \"Ach, und von deinem fetten Arsch haben sie nichts gesagt?\"\nSie: \"Nein, von dir war nicht die Rede.\"",
    "Welches sind die teuersten Tomaten?\n-\nGeldautomaten.",
    "Warum sitzen in einem Hubschrauber immer 2 Leute?\n-\nDer eine hupt, der andere schraubt!",
    "Ein Polizeibeamter kontrolliert einen Straßenmusikanten. Nachdem sich der Polizist den Personalausweis angesehen hat, sagt er zu dem Musikanten: \"Begleiten Sie mich bitte.\"\n\"Aber gern, Herr Wachtmeister, was wollen Sie denn singen?\"",
    "Nur die Dunkelheit ist real, das Licht scheint nur so.",
    "Ober: \"Wie fanden Sie das Filetsteak, mein Herr?\"\nGast: \"Ganz zufällig, als ich das Gemüse beiseite schob.\"",
    "Lehrerin: \"Fritzchen, nenne mir bitte fünf Tiere aus Afrika?\"\nFritzchen: \"Zwei Löwen und drei Elefanten.\"",
    "Lehrer: \"Fritzchen, was ist das für ein Schmetterling?\"\n\"Ein Zitronenfalter, Herr Lehrer!\"\n\"Aber Fritzchen der hier ist grün und nicht gelb!\"\n\"Vielleicht ist er noch nicht reif, Herr Lehrer!\"",
    "Der Lehrer fragt Fritzchen: \"Wo wurde der Friedensvertrag von 1918 unterschrieben?\"\nNach längerem Nachdenken kommt die Antwort: \"Unten rechts!\"",
    "Fritzchen geht auf dem Markt umher.\nEr hört einen Verkäufer: \"Heiße Würstchen! Heiße Würstchen!\"\nSofort rennt Fritzchen zu ihm hin: \"Angenehm, heiße Fritzchen.\"",
    "In der Schule fragt der Lehrer: \"Wer kann mir die drei Eisheiligen nennen?\"\nMeldet sich Fritzchen: \"Langnese, Schöller und Mövenpick!\"",
    "Warum darf ein Herzkranker kein Cola und Pils gleichzeitig trinken?\n-\nWeil er sonst colabiert.",
    "Gute Nachricht: Ich bekomme endlich den obersten Knopf meiner superengen Jeans zu.\nSchlechte Nachricht: Habe sie leider nicht an.",
    "Ein Mathematiker springt aus dem Fenster und fliegt nach oben! Was ist passiert?\n-\nVorzeichenfehler.",
    "Was machen zwei wütende Schafe?\n-\nSie kriegen sich in die Wolle.",
    "Was sagt der eine Dünnpfiff zum anderen?\n-\n\"Du, das läuft ja flüssig!\"",
    "Geht ein Cowboy zum Coiffeur. Als er wieder rauskommt, ist sein Pony weg.",
    "Was macht ein Clown im Büro?\n-\nFaxen.",
    "Wie nennt man Kaninchen im Fitnessstudio?\n-\nPumpernickel.",
    "Warum summen Bienen?\n-\nWeil sie den Text nicht kennen!",
    "Treffen sich zwei Magnete. Sagt der eine: \"Was soll ich heute bloß anziehen?\"",
    "Wieso können Skelette schlecht lügen?\n-\nWeil sie so gut zu durchschauen sind.",
    "Wo macht ein Skelett Urlaub?\n-\nAm Toten Meer.",
    "Kommt ein Skelett zum Arzt. Sagt der Arzt: „Sie sind aber spät dran!“",
    "Geht ein Neutron in eine Disco. Sagt der Türsteher: \"Hier kommen heute nur geladene Gäste rein!\"",
    "Wissenschaftler haben herausgefunden...\nund sind dann wieder reingegangen.",
    "Was fängt mit “T” an und endet mit “itten“?\n-\nTiefkühlpommfritten.",
    "Warum kann ein Känguru höher springen als ein Haus?\n-\nWeil das Haus nicht springen kann.",
    "Was machen die Ostfriesen, wenn sie einen Stromausfall haben?\n-\nSie gehen an den Strand und holen sich ein paar Kilo Watt.",
    "Bei welcher Fahrt wird hauptsächlich geflogen?\n-\nBei der Raumfahrt.",
    "Was passiert mit einem weißen Stein, der ins Rote Meer geworfen wird?\n-\nEr wird nass.",
    "Welches Brot kann man nicht zum Frühstück essen?\n-\nDas Abendbrot.",
    "Einige Monate haben 30 Tage, andere haben 31 Tage. Doch wie viel Monate haben 28 Tage?\n-\nAlle.",
    "\"Medkiametne.\"\n\"Du hast dich da vertippt.\"\n\"Sie sind verschreibungspflichtig!\"",
    "Wo lagert ein Fisch sein Geld?\n-\nIn einer Sandbank.",
    "Ein soziales Netzwerk für Forstarbeiter, bei dem man auf \"Gefällt\" klicken kann.",
    "Einem Mann fällt sein Smartphone runter. Das Gerät ist unbeschädigt. Wie ist das möglich?\n-\nEs war im Flugmodus.",
    "Veganer feiern nicht. Sie lassen einfach die Sau raus.",
    "Was haben ein Auto und eine Banane gemeinsam?\n-\nBei beiden geht es um Reifen!",
    "Warum tragen Elefanten rote Socken?\n-\nWeil die Grünen in der Wäsche sind.",
    "\"Ich bin völlig gerührt\", sagte der Teig.",
    "\"dieses Radio hat aber viele Knöpfe\", wundert sich die Kundin. \"Das stimmt\", gibt die Verkäuferin zu. \"aber mit einem Reißverschluss würde es albern aussehen!\"",
    "Kaffee zur Sahne: \"Komm zu mir in die Tasse!\" die Sahne zögert. Kaffee: \"Ach Sahne, komm doch zu mir in die Tasse!\" Sahne: \"Na gut, bevor ich mich schlagen lasse\"",
    "\"Hast du Hunger?\" - \"Wieso, brauchst du welchen?\"",
    "\"Herr Ober, die Suppe schmeckt aber komisch.\" - \"Wieso lachen Sie dann nicht?\"",
    "Er wollte Beethoven, sie Mozart. Es gab Händel.",
    "Wie nennt man ein schwäbisches um Hilfe rufendes Ferkel?\n-\nNotrufsäule",
    "\"Was machen Sie eigentlich beruflich?\"\n\"Ich studiere dual.\"\n\"Haben Sie mich gerade Aal genannt?\"",
    "Hätten Frauen ebenfalls eine stark ausgeprägte Gesichtsbehaarung hieße es nicht Beziehung, sondern Bartnerschaft.",
    "Wie heißt der nordische Gott der Ungeduld?\n-\nHammersbald",
    "Was macht ein Clown im Büro?\n-\nFaxen",
    "Warum sind Seeräuber untereinander beste Freunde?\n-\nWeil sie nicht so gut trennen können zwischen beruflich und Pirat.",
    "Ich hatte mal einen Witz über die deutsche Bahn erzählt aber der kam überhaupt nicht an...",
    "\"Ich hätte einen Witz über Paint\"\n\"Aber?\"\n\"der würde ein schlechtes Bild von mir zeichnen...\"",
    "Wie küssen sich Haie?\n-\nMit ihren Heizungen.",
    "Was macht ein Pirat vor dem Computer?\n-\nEr drückt die Enter-Taste.",
    "Telefonieren zwei Informatiker: \"Na, wie ist das Wetter bei dir?\" \"Caps Lock.\" \"Hä?\" \"Shift ohne Ende!\"",
    "Linux wird nie das meistinstallierte Betriebssystem sein, wenn man bedenkt, wie oft man Windows neu installieren muss!",
    "Was ist der größte Nachteil von Linux?\n-\nDass man sich irgendwann nicht mehr an den Installationsvorgang erinnern kann!",
    "Was ist das Problem mit git Witzen?\n-\nJeder hat seine eigene Version!",
    "Warum haben Scrum Master im Winter bei Schneefall immer geräumte Wege?\n-\nIhr Motto ist \"ship early, ship often\"",
    "Treffen sich drei lustige Helium-Atome: HeHeHe",
    "Welcher Käse wird bei den historischen Festspielen serviert?\n-\nMittelalter Gouda",
    "Warum verwechseln Informatiker Weihnachten und Halloween?\n-\nWeil Oct31 = Dec 25",
    "Warum können Piraten keinen Kreis berechnen?\n-\nWeil sie Pi raten!",
    "Was macht ein Mathematiker im Garten?\n-\nWurzeln ziehen.",
    "Zwei Mathematiker am Gartengrill: \"Ist schon gebratenes λ?\"\n\"Nein, das φ ist noch ρ.\"",
    "Wie fängt ein Mathematiker in der Steppe einen Löwen?\n-\nEr baut sich einen Käfig, setzt sich hinein und definiert: \"Hier ist außen!\"",
    "Warum sind bei IKEA Pfeile am Boden?\n-\nEs ist ein Einrichtungshaus.",
    "Warum gehen Ameisen nicht in die Kirche?\n-\nSie sind InSekten!",
    "Wieso steht ein Pils im Wald?\n-\nWeil die Tannen zapfen!",
    "Was ist grün, glücklich und hüpft von Grashalm zu Grashalm?\n-\nEine Freuschrecke.",
    "Was ist ein Keks unterm Baum?\n-\nEin schattiges Plätzchen.",
    "\"Klugscheißer mag niemand\"\n-\n\"Fast niemand!\"",
    "\"Mein Computer ist kaputt, er schreibt nur noch Großbuchstaben!\"\n\"Hast du die Feststelltaste gedrückt?\"\n\"Nein, das hab ich selbst herausgefunden.\"",
    "Wenn in einem Hühnerstall alle Hennen mit einem Laserschwert getötet werden ist der Hahn solo.",
    "Deutsch ist eine einfache Sprache.\nWenn etwas auf der Straße liegt hat man zwei Möglichkeiten:\n1. Das Objekt umfahren\n2. Das Objekt umfahren",
    "Kind zum Vater: \"Ich bin hungrig!\"\nAntwortet der Vater: \"Hallo Hungrig, ich bin dein Vater:\"",
    "\"Die Haare wachsen lassen\" und \"die Haare wachsen lassen\" kann im deutschen genau das Gegenteil voneinander heißen!",
    "Multitasking ist meine Stärke. Ich kann gleichzeitig zuhören, ignorieren und vergessen!",
    "\"Was machst du heute?\"\n\"Bauch und Nacken.\"\n\"Cool, dann bis später im Fitness!\"\n\"Hä, haben die da auch einen Grill?\"",
    "Ich war mit meiner Jogginghose schon genauso oft joggen wie ich mit meiner Küchenrolle durch die Küche gerollt bin!",
    "Was ist der Hauptgrund für trockene Haut?\n-\nHandtücher",
    "\"bist du aufgeregt?\"\n\"schon ein bisschen...\"\n\"ist es dein erstes Mal?\"\n\"nein, ich war schon öfter aufgeregt!\"",
   "Welche Autofahrer sind besonders entgegenkommend?\n-\nGeisterfahrer",
   "Wieso bevorzugen Programmierer den dark Mode?\n-\nWeil Licht Bugs anlockt.",
   "Wie nennt man die Zeitform, wenn der Bus pünktlich kam?\n-\nBuskamperfekt",
   "\"Was machen die Pilze auf deiner Pizza?\"\n\"Als Belag funghieren.\"",
   "Eigentlich wollte ich dir einen Zeitreisewitz erzählen. Den mochtest Du aber nicht.",
   "\"Polizeikontrolle: \"Haben Sie was getrunken?\"\n\"Nein\"\n\"Das sollten Sie aber. Ca. 2 LIter Wasser braucht man am Tag\"",
   "Es klingelt an der Türe. \"Guten Tag, wir sammeln fürs Kinderheim.\"\n\"Kevin, komm schnell her!\"",
   "Was ist süß, klebrig und läuft durch die Wüste?\n-\nEin Karamel.",
   "Treffen sich zwei Jäger im Wald. Beide tot.",
   "Wie nennt man eine mittelmäßige Sonnenbank?\n-\nSolalarium",
   "\"Ich würde gerne einen Baumstamm kaufen.\"\n\"Sorry, dafür müssen Sie in unser Stammhaus. Das hier ist nur eine Zweigstelle.\"",
   "Witze über Tofu find ich geschmacklos.",
   "Was sagt der Origami-Lehrer zu seinem aufmüpfigen Schüler?\n-\nDas kannste knicken!",
   "Was fliegt durch das All und ist vegan?\n-\nEin Tufo!",
   "Was macht man, wenn man eine neue Brotsorte erfinden möchte?\n-\nMan backt einen Brototyp!",
   "\"Die Raubkatze sieht gut aus!\"\n\"In English please!\"\n\"Luchs gut\"",
   "Wie nennt man einen Briefträger mit Alkoholproblem?\n-\nProstbote",
   "Gute Deutschlehrer machen ihren Job nicht wegen dem Geld.\nSie machen ihn wegen des Geldes.",
   "Wer kommt nachts und deckt die kleinen Elektroniker zu?\n-\nDas Nandmännchen.",
   "\"Wie finden Sie unser neues Hautpflegeprodukt?\"\n-\n\"Ausschlaggebend!\"",
   "Ich habe gerade ein Blatt gelocht.\nAber das nur am Rande.",
   "Kollege kommt ins Büro gestürzt und meint, dass die Antwort auf alle Fragen 21 ist.\nDas ist also dieses gefährliche Halbwissen.",
   "Wieso findet ein Henker nie nach Hause?\n-\nWeil er nur die Hinrichtung kennt!",
   "Als ich klein war, hat mich meine Mutter immer zu dem kleinen Laden um die Ecke geschickt. Mit 1DM. Ich kam zurück nach Hause mit 2kg Kartoffeln, 2 Broten, 3 Flaschen Milch, einem großen Stück Käse, 1 Pfund Kaffee und 6 Eiern. Heute geht das nicht mehr.\nZu viele Überwachungskameras!",
   "Wie kann man einen schottischen Arzt noch nennen?\n-\nHeilander",
   "Wenn sich Informatiker streiten...\nIst der Streit dann vorprogrammiert?",
   "Frau: Was machst du da?\nMann: Ich lösche Cookies.\nFrau: Du naschst Weihnachtsgebäck!\nMann: Ich lösche Cookies.",
   "Was hat Flügel, aber kann nicht fliegen und kann laufen, obwohl es keine Beine hat?\n-\nDie Nase!",
   "Was ist wenn ein Riese in den Schnee fällt?\n-\nWinter!",
   "Welcher Handwerker ist der lauteste?\n-\nDer Schreiner!",
   "Egal wie dicht du bist, Göthe war Dichter!",
   "Warum schwimmen Eichhörnchen nur auf dem Rücken?\n-\nDamit die Nüsse trocken bleiben.",
   "Wie nennt man illegale Posts auf Mastodon?\n-\nTrötungsdelikt",
   "Es gibt übrigens keine dicken Veganer.\nNur pflanzliche Fette.",
   "Wer hat die krakeligste Handschrift?\n-\nDer Oktopus.",
   "\"Sag mir einen Kalauer!\"\n\"J\"\n\"Na, weil dahinter ein K lauert.\"",
   "Wie kann man einen schottischen Arzt noch nennen?\n-\nEr ist ein Heilander."
  ],
  "en": [
    "A QA engineer walks into a bar.\nOrders a beer.\nOrders 2 beers.\nOrders 0 beers.\nOrders 1e30 beers.\n\nFirst real customer walks in and asks where the bathroom is. The bar bursts into flames, killing everyone.",
    "An SQL query goes into a bar, walks up to two tables and asks: \"can I join you?\"",
    "Kid to father: \"I'm hungry!\"\nFather: \"Hi Hungry, I'm Dad!\"",
    "Why did the functions stop calling each other?\n-\nbecause they had constant arguments!",
    "Knock. Knock\nA concurrency bug!\nWho is it?",
    "What is the longest word in the english language?\n-\n\"smiles\" because there's a mile between the s's.",
    "When a computer overheats, it freezes.",
    "There are only two hard problems in distributed systems: 2. Exactly-once delivery 1. Guaranteed order of messages 2. Exactly-once delivery",
    "\"Oh, they've done it!\"\n\"How many asynchronous programmers does it take to change a light bulb?\"",
    "Why do prices in hungary not have decimal places?\n-\nBecause they pay in forint, not forfloat.",
    "Astronauts use Linux because you can't open windows in space",
    "I have a statistics joke, but it's not significant.",
    "I have a geography joke, but I don't know where it is.",
    "My wife told me to take the spider out instead of killing him.\nWent out. Had a few drinks. Nice guy. He's a web designer.",
    "A book fell on my head.\nI only have my shelf to blame.",
    "Did you hear about the optician who made the biggest pair of glasses in the world?\nIt was a huge spectacle!",
    "Optimist: The glass is ½ full.\nPessimist: The glass is ½ empty.\nExcel: The glass is January 2nd.",
    "When hiring, print out all the resumes and place in a pile on your desk. Take the top half and throw them away. You don't want to hire people that are unlucky.",
    "What's the object-oriented way to become wealthy?\n-\nInheritance",
    "I lost three fingers on my right hand, so I asked my doctor if I would still be able to write with it.\nHe said: \"Maybe, but I wouldn't count on it.\"",
    "What’s the difference between C++ and C?\n-\n1",
    "Which one is faster, hot or cold?\n-\nHot.\nBecause you can catch a cold.",
    "Two men are talking to each other. \"My wife asked my to take up yoga classes with her.\"\n\"What did you tell her?\"\n\"I said it puts me in an awkward position.\"",
    "Why do cows wear bells?\nBecause their horns don't work.",
    "I don't trust stairs. They are always up to something.",
    "If GH can stand for P as in Hiccough,\nIf OUGH stands for O as in Dough,\nIf PHTH stands for T as in Phthisis,\nIf EIGH stands for A as in Neighbor,\nIf TTE stands for T as in Gazette,\nIf EAU stands for O as in Plateau,\n\nThe right way to spell POTATO should be:\n\nGHOUGHPHTHEIGHTTEEAU.",
    "An infinite number of mathematicians walk into a bar. The first says, \"Give me a beer.\" The second says, \"I'll have half a beer.\" The third says, \"A quarter of a beer, please.\" The bartender pours two beers and says, \"Come on, people. Know your limits.\"",
    "A man walks into a pub and says, \"Give me three pints of Guinness, please.\"\nSo the bartender brings him three pints and the man proceeds to alternately sip one, then the other, then the third until they're gone.\nHe then orders three more and the bartender says, \"Sir, I know you like them cold, so you can start with one and I'll bring you a fresh one as soon as you're low.\"\nThe man says, \"You don't understand. I have two brothers, one in Australia and one in the States. We made a vow to each other that every Saturday night we'd still drink together. So right now, my brothers have three Guinness Stouts too and we're drinking together.\"\nThe bartender thinks it's a wonderful tradition and every week he sets up the guy's three beers as soon as he enters in the bar. Then one week, the man comes in and orders only two. He drinks them, then orders two more. The bartender sadly says, \"Knowing your tradition, I'd just like to just say that I'm sorry that one of your brothers died.\"\nThe man replies, \"Oh, my brothers are fine – I just quit drinking.\"",
    "Three logicians walk into a bar. The bartender asks, \"Does everyone want beer?\"\nThe first logician says, \"I don't know.\" The second logician says, \"I don't know.\" The third logician says, \"Yes.\"",
    "There are only two hard things in Computer Science: cache invalidation, naming things, and off-by-one errors."
  ]
}
